const resources = {
  kz: {
    translation: {
      greeting:
        "«Алматы Ұстазы - 2023» жас мұғалімдердің кәсіби байқауына шақырамыз! ",
      accept: "Жеке деректерімді өңдеу саясатымен келісемін",
      Hod: "Байқаудық барысы",
      ready: "Дайындық кезеңі: ",
      register: "Тіркелу",
      type: "Email енгізіңіз",
      speakers: "Спикерлер",
      stages: "Байқау кезеңдері",
      prize: "Жүлделер",
      participate: "Қатысушы болу",
      login: "Кіру",
      logout: "Шығу",
      personal: "Жеке кабинет",
      first: "20 наурыз – 29 наурыз: байқау платформасында онлайн тіркеу",

      second:
        "30 наурыз. Онлайн-конференция. Байқаудың бірінші кезеңінің мақсаты, міндеттері мен критерийлері.",
      third: "7-14 сәуір: Байқау платформасына мультимедиялық мақаланы жүктеу",
      fourth:
        "17-26 сәуір. Мультимедиялық мақалаларды Сараптау комиссиясының бағалау күндері.",
      fifth: "26 сәуір. I кезеңнің қорытындысы платформада жарияланады",
      important: "Маңызды мәселе!",
      attention: "Назар аударыңыз!",
      attentionFirst:
        "Мультимедиялық мақаланың мәтінінде педагогтер өз пәні шеңберінде тиімді оқыту мен тәрбиелеу принциптері негізделген философиялық көзқарастарын, педагогикалық ұстанымын сипаттайды (мақаланың мазмұны бағаланады). Мақаланың мультимедиялық  көрсетілімінде аудио, бейне, графикалық, мәтіндік және/немесе басқа сандық ресурстар үйлесімді қолданылу қажет (мақаланың мультимедиялық берілуі бағаланады).Мақалада педагогтің соңғы 3 жылдағы білім беру қызметіндегі жеке кәсіби жетістіктері, оқушыларды оқыту, тәрбиелеу және дамытудың нәтижелері, мектептің, қаланың білім беру жүйесін дамытуға қосқан үлесі міндетті түрде қамтылуы тиіс. ",
      importantFirst:
        "Әрбір педагогтің жұмысын 3 (үш) сарапшы бағалайды (ғалым, әдіскер, мұғалім). Бастауыш білім беру және әрбір оқу пәні бойынша жұмыстары ең жоғары баллға ие болған 8 (сегіз) педагог байқаудың екінші кезеңіне өтеді.   ",
      secondStage: "II кезең - «Мен кәсіби мұғаліммін»: 28 сәуір - 12 мамыр.",
      secondStageFirst:
        "28 сәуір. Онлайн-конференция. Байқаудың екінші кезеңінің мақсаты, міндеттері мен критерийлері.",
      secondStageSecond:
        "Байқауға қатысушылар Сараптамалық кеңес мүшелерінің қатысуымен сабақ өткізеді. Сабақтың ұзақтығы - 45 минут.",
      importantSecond:
        "Әрбір пәннің Сараптамалық кеңесі байқаудың I және II кезеңдердің қорытындысымен байқаудың III кезеңіне өтетін 11 финалистті (әрбір  пәннен 1 педагог) анықтайды.",
      attentionSecond:
        "Сабақта педагогтің «Менің білім беру философиям» тақырыбындағы мультимедиялық мақалада сипаттаған білім берудің философиялық негіздемесі мен педагогикалық ұстанымы көрініс табуы тиіс. Әрбір педагогтің сабағын 3 (үш) сарапшы бағалайды (ғалым, әдіскер, мұғалім). Сабақтың жазбасы байқаудың Youtube арналарында орналастырылады.",
      final: "17 мамыр. Финалға шыққан педагогтер платформада жарияланады.",
      thirdStageOne:
        "III кезең - «Мен мұғалім-көшбасшымын»: 13 қыркүйек – 22 қыркүйек",
      thirdStageTwo:
        "13 қыркүйек. Онлайн-конференция. Байқаудың үшінші кезеңінің мақсаты, міндеттері мен критерийлері.",
      thirdStageThree:
        "19-22 қыркүйек. 1. Финалға шыққан әрбір педагог «Мен мұғалім-көшбасшымын» атты авторлық шеберлік сағатын өткізеді.2. Алматы қаласы Білім басқармасы басшысының қатысуымен «Заманауи білім берудің өзекті міндеттері» тақырыбындағы дөңгелек үстел – панельдік пікірталас.Шеберлік сағатына әрбір педагогке берілетін уақыт - 30 минутқа дейін.",
      thirdStageFour:
        "Шеберлік сағатының мазмұны алдыңғы I және II кезеңнің мазмұнынан туындауы тиіс. Яғни, шеберлік сағатында педагог байқаудың I кезеңдегі «Менің білім беру философиям» мультимедиялық мақалада жариялаған білім берудің философиялық негіздемесі мен педагогикалық ұстанымын қорғайды, бұл философияның II кезеңдегі  «Мен кәсіби мұғаліммін» айдарымен өткізілген сабақтағы қолданыс тапқанын көрсетеді және педагогикалық ұстанымының нәтижелілігін 3 жылдағы білім беру қызметіндегі жеке кәсіби жетістіктері, оқушыларды оқыту, тәрбиелеу және дамытудың нәтижелері, мектептің, қаланың білім беру жүйесін дамытуға қосқан үлесі арқылы дәлелдейді. ",
      thirdStageFive:
        "«Заманауи білім берудің өзекті міндеттері» дөңгелек үстел – панельдік пікірталаста педагогтердің білім берудің өзекті мәселелерін сезінуі, оларды шешу бойынша айтқан пікірлерінің дәйектілігі бағаланады.Педагогтердің шеберлік сағаттары мен дөңгелек үстелде айтқан пікірлерін  барлық 11 пәннің Сарапшылары бірге отырып бағалайды",
      thirdStageSix:
        "ІІІ кезеңнің қорытындысы бойынша байқаудың жалпы қорытындысы шығады: Гран - при (1); I орын (1); II орын (1); III орын (2). Барлығы – 5 жеңімпаз анықталады.",
      thirdStageSeven:
        "Байқау шарттарымен таныссаң қатысуға асық! Ұстаздың құтты білігінен шәкірттің құнды біліміне жеткізер жолды көрсет!",
      give: "Қатысуға өтінім беру",
      now: "Дәл қазір тіркел!",
      fast: "2022 жылдың 10 қыркүйегіне дейін тіркелуге және қатысуға өтінім беруге асығыңыз",
      create: "Байқауды ұйымдастырушы",
      almaty: "Алматы қаласының Білім басқармасы",
      contact: "Байланыс деректері",
      come: "Қатысуға шақырамыз",
      age: "Конкурсқа Алматы қаласының мемлекеттік білім беру ұйымдарындағы оқу жоспарының барлық пәндері бойынша 36 жасқа дейін қоса алғанда 1-11 сынып мұғалімдері қатыса алады",
      wifi: "электрондық тіркеуден өтіп, сауалнаманы толтырыңыз",
      down: "түйіндемені, фотосуретті және еңбек өтілі көрсетілген жұмыс орнынан анықтаманың скан-көшірмесін жүктеңіз",
      like: "академиялық адалдық қағидаттарын сақтаңыз",
      birth: "Туған күніңізді енгізіңіз",
      send: "Жіберу",
      degree: "Біліктілік санаты",
      school: "Жұмыс орны",
      subject: "Оқытылатын пән",
      time: "Жалпы педагогикалық еңбек өтілі",
      current: "Осы мектептегі жұмыс өтілі",
      english: "Ағылшын тілін білуі",
      language: "Оқыту тілі",
      yes: "Иә",
      no: "Жоқ",
      password: "Құпия сөз",
      writePassword: "Құпия сөзді енгізіңіз",
      writeNickname: "Никнеймді енгізіңіз",

      surname: "Тегіңізді енгізіңіз",
      name: "Атыңызды енгізіңіз",
      middle: "Әкесінің атыңызды енгізіңіз",
      full: "ТАӘ",
      birthday: " Туған күніңіз",
      mainPage: "Басты бетке өту",
      more: "Толықтыру",
    },
  },
  ru: {
    translation: {
      greeting:
        "Приглашаем на профессиональный конкурс молодых учителей «Алматы Ұстазы - 2023»!",
      accept: "Согласен с политикой обработки личных данных",
      hod: "Ход проведения конкурса",
      register: "Зарегистрироваться",
      type: "Введите Email",
      ready: "Подготовительный период:",

      speakers: "Спикеры",
      stages: "Этапы конкурса",
      prize: "Призы",
      participate: "Участвовать",
      login: "Войти",
      logout: "Выйти",
      personal: "Личный кабинет",
      first:
        "20 февраля – 29 февраля: онлайн регистрация на платформе конкурса",
      second:
        "30 марта. Онлайн-конференция. Цель, задачи и критерий оценки первого этапа",
      third:
        "7-14 апреля: Загрузка мультимедийной статьи на  платформу конкурса",
      fourth:
        "17-26 апрель. Экспертиза и оценка мультимедийной статьи Экспертной комиссией.",
      fifth: "26 апрель. Итоги I этапа объявляется на платформе конкурса.",
      important: "Это важно!",
      attention: "Внимание!",
      attentionFirst:
        "В содержании статьи участники описывают свое философское обоснование и педагогическую концепцию эффективного обучения и воспитания в рамках собственного предмета (оценивается содержание статьи).Содержание материала должно быть представлено в формате мультимедийной статьи с применением доступных (в том числе, собственных) аудио-, видео-, графических, текстовых и/или иных цифровых ресурсов (оценивается мультимедийные составляющие статьи).В качестве подтверждения, статья конкурсанта должна обязательно содержать личные профессиональные достижения в образовательной деятельности, результаты обучения и воспитания и развития учащихся, вклад педагога в развитие системы образования школы, города за последние 3 года;",
      importantFirst:
        "Работу каждого педагога оценивает 3 (три) эксперта (ученый, методист, учитель). 8 (восемь) участников по начальному образованию и по  каждому учебному предмету работы которых удостоены наибольшего балла, проходят на второй этап конкурса.",
      secondStage: "II этап - «Я учитель - профессионал»: 28 апрель - 12 май.",
      secondStageFirst:
        "28 апрель. Онлайн-конференция. Цель, задачи и критерий оценки второго этапа",
      secondStageSecond:
        "Участник конкурса проводит урок с учащимися другой школы в присутствии членов Экспертного совета. Продолжительность урока – 45 минут.",
      importantSecond:
        "Экспертный совет по каждому учебному предмету по результатам  I и II этапов определяет 11 финалиста (1 победитель по каждому предмету) которые проходят на III этап конкурса.",
      attentionSecond:
        "На уроке должны отражаться философское обоснование и педагогическая концепция описанные в мультимедийной статье. Урок каждого педагога оценивает 3 (три) эксперта (ученый, методист, учитель). Урок транслируется на видеохостинг YouTube.",
      final:
        "17 май. Педагоги прошедшие на финал объявляется на платформе конкурса ",
      thirdStageOne:
        "III этап - «Я – учитель-лидер»: 13 сентября – 22 сентября",
      thirdStageTwo:
        "13 сентября. Онлайн-конференция. Цель, задачи и критерий оценки третьего этапа",
      thirdStageThree:
        "19-22 сентября. 1. Каждый педагог вышедший на финал проводит «Мастер-класс: «Я – учитель-лидер» 2. С участием руководителя Управления образования г. Алматы проводится панельная дискуссия: «Актуальных задач современного образования»Время проведения мастер-класса каждого педагога – до 30 минут. ",
      thirdStageFour:
        "Содержание мастер-класса должно вытекать от содержаний I и II туров. То есть, на мастер-классе педагог защищает свое философское обоснование и педагогическую концепцию изложенные в мультимедийной статье «Моя философия образования» I тура, показывает отражение данной философий на своем уроке «Я учитель - профессионал» II тура и доказывает результативность педагогической концепций через личные профессиональные достижения в образовательной деятельности, результаты обучения и воспитания и развития учащихся, вклад педагога в развитие системы образования школы, города за последние 3 года.",
      thirdStageFive:
        "На круглом столе - панельная дискуссия «Актуальных задач современного образования» оцениваются чувствие участником  актуальных задач современного образования, обоснованность идей по решению поставленных задач.Мастер-класс и выступление педагога на круглом столе - панельной дискуссий оценивают все эксперты 11 предметов конурса.По итогам ІІІ этапа конкурса и будут определены:Гран - при (1); I место (1); II место (1); III место (2). Всего – 5 победителя конкурса.",
      thirdStageSix:
        "По итогам III этапа подводятся общие итоги конкурса: Гран - при (1); I место (1); II место (1); III место (2). Всего-5 победителей.",
      thirdStageSeven:
        "Если ознакомились с условиями конкурса торопитесь участвовать! Ұстаздың құтты білігінен шәкірттің құнды біліміне жеткізер жолды көрсет!",
      give: "Подача заявки на участие",
      now: "Зарегистрируйтесь прямо сейчас!",
      fast: "Заявка на регистрацию и участие до 10 сентября 2022 года спешите отдать",
      create: "Организатор конкурса",
      almaty: "Управление образования города Алматы",
      contact: "Контактные данные",
      come: "Приглашаем принять участие",
      age: "В конкурсе могут принять участие учителя 1-11 классов по всем предметам учебного плана в государственных организациях образования города Алматы до 36 лет включительно",
      wifi: "пройдите электронную регистрацию и заполните анкету",
      down: "скачать резюме, фото и скан-копию справки с места работы с указанием стажа работы",
      like: "соблюдайте принципы академической честности",
      birth: "Дата рождения",
      send: "Отправить",
      degree: "Квалификационная категория ",
      school: "Место работы",
      subject: "Преподоваемый предмет",
      time: "Общий педагогический стаж",
      current: "Стаж работы в данной школе",
      english: "Знание английского языка",
      language: "Язык обучения",
      yes: "Да",
      no: "Нет",
      password: "Пароль",
      writePassword: "Введите пароль",
      writeNickname: "Введите никнейм",
      name: "Введите имя",
      surname: "Введите фамилию",
      middle: "Введите отчество",
      full: "ФИО",
      birthday: "Дата рождения",
      mainPage: "Перейти на главную страницу",
      more: "Дополнить",
    },
  },
};

export default resources;
