import React from 'react'
import ButtonComponent from '../../components/Button/Button.component'
import '../../index.scss'
type Props = {
  refStage?: React.RefObject<HTMLInputElement>
  refSpeaker?: React.RefObject<HTMLInputElement>
}
const Stages = ({ refSpeaker, refStage }: Props) => {
  return (
    <>
      <div id="id1" className="one" ref={refStage}>
        <h1 className="active">Байқауды өткізу кезеңдері</h1>
        <div className="crd active">
          <h3 style={{ color: 'blue' }}>
            I кезең - «Менің білім беру философиям»: 30 наурыз – 26 сәуір
          </h3>
          <h5>
            30 наурыз. Онлайн-конференция. Байқаудың бірінші кезеңінің мақсаты,
            міндеттері мен критерийлері.
          </h5>
          <h5>
            7-14 сәуір: Байқау платформасына мультимедиялық мақаланы жүктеу.
          </h5>
          <h5>
            {' '}
            17-26 сәуір. Мультимедиялық мақалаларды Сараптау комиссиясының
            бағалау күндері.
          </h5>
          <h5>26 сәуір. I кезеңнің қорытындысы платформада жарияланады</h5>
          <h3 style={{ color: 'blue' }}>Назар аударыңыз!</h3>
          <p>
            Мультимедиялық мақаланың мәтінінде педагогтер өз пәні шеңберінде
            тиімді оқыту мен тәрбиелеу принциптері негізделген философиялық
            көзқарастарын, педагогикалық ұстанымын сипаттайды (мақаланың мазмұны
            бағаланады). Мақаланың мультимедиялық көрсетілімінде аудио, бейне,
            графикалық, мәтіндік және/немесе басқа сандық ресурстар үйлесімді
            қолданылу қажет (мақаланың мультимедиялық берілуі бағаланады).
            Мақалада педагогтің соңғы 3 жылдағы білім беру қызметіндегі жеке
            кәсіби жетістіктері, оқушыларды оқыту, тәрбиелеу және дамытудың
            нәтижелері, мектептің, қаланың білім беру жүйесін дамытуға қосқан
            үлесі міндетті түрде қамтылуы тиіс.
          </p>
          <p style={{ color: 'blue' }}>
            Маңызды мәселе! Әрбір педагогтің жұмысын 3 (үш) сарапшы бағалайды
            (ғалым, әдіскер, мұғалім). Бастауыш білім беру және әрбір оқу пәні
            бойынша жұмыстары ең жоғары баллға ие болған 8 (сегіз) педагог
            байқаудың екінші кезеңіне өтеді.
          </p>
        </div>
        <div className="crd active">
          <h4 style={{ color: 'blue' }}>
            II кезең - «Мен кәсіби мұғаліммін»: 28 сәуір - 12 мамыр
          </h4>
          <h3>
            28 сәуір. Онлайн-конференция. Байқаудың екінші кезеңінің мақсаты,
            міндеттері мен критерийлері.
          </h3>
          <h3>
            Байқауға қатысушылар Сараптамалық кеңес мүшелерінің қатысуымен сабақ
            өткізеді. Сабақтың ұзақтығы - 45 минут.
          </h3>
          <h3 style={{ color: 'blue' }}>Назар аударыңыз!</h3>

          <p>
            Сабақта педагогтің «Менің білім беру философиям» тақырыбындағы
            мультимедиялық мақалада сипаттаған білім берудің философиялық
            негіздемесі мен педагогикалық ұстанымы көрініс табуы тиіс. Әрбір
            педагогтің сабағын 3 (үш) сарапшы бағалайды (ғалым, әдіскер,
            мұғалім). Сабақтың жазбасы байқаудың Youtube арналарында
            орналастырылады.
          </p>
          <p style={{ color: 'blue' }}>
            Маңызды мәселе! Әрбір пәннің Сараптамалық кеңесі байқаудың I және II
            кезеңдердің қорытындысымен байқаудың III кезеңіне өтетін 11
            финалистті (әрбір пәннен 1 педагог) анықтайды.
          </p>
          <h3>17 мамыр. Финалға шыққан педагогтер платформада жарияланады.</h3>
        </div>
        <div className="crd passive">
          <h4 style={{ color: 'blue' }}>
            III кезең - «Мен мұғалім-көшбасшымын»: 13 қыркүйек – 22 қыркүйек
          </h4>
          <p>
            13 қыркүйек. Онлайн-конференция. Байқаудың үшінші кезеңінің мақсаты,
            міндеттері мен критерийлері.
          </p>
          <p>
            19-22 қыркүйек. 1. Финалға шыққан әрбір педагог «Мен
            мұғалім-көшбасшымын» атты авторлық шеберлік сағатын өткізеді. 2.
            Алматы қаласы Білім басқармасы басшысының қатысуымен «Заманауи білім
            берудің өзекті міндеттері» тақырыбындағы дөңгелек үстел – панельдік
            пікірталас. Шеберлік сағатына әрбір педагогке берілетін уақыт - 30
            минутқа дейін.
          </p>
          <p>
            Шеберлік сағатының мазмұны алдыңғы I және II кезеңнің мазмұнынан
            туындауы тиіс. Яғни, шеберлік сағатында педагог байқаудың I
            кезеңдегі «Менің білім беру философиям» мультимедиялық мақалада
            жариялаған білім берудің философиялық негіздемесі мен педагогикалық
            ұстанымын қорғайды, бұл философияның II кезеңдегі «Мен кәсіби
            мұғаліммін» айдарымен өткізілген сабақтағы қолданыс тапқанын
            көрсетеді және педагогикалық ұстанымының нәтижелілігін 3 жылдағы
            білім беру қызметіндегі жеке кәсіби жетістіктері, оқушыларды оқыту,
            тәрбиелеу және дамытудың нәтижелері, мектептің, қаланың білім беру
            жүйесін дамытуға қосқан үлесі арқылы дәлелдейді.
          </p>
          <p>
            Назар аудар! «Заманауи білім берудің өзекті міндеттері» дөңгелек
            үстел – панельдік пікірталаста педагогтердің білім берудің өзекті
            мәселелерін сезінуі, оларды шешу бойынша айтқан пікірлерінің
            дәйектілігі бағаланады. Педагогтердің шеберлік сағаттары мен
            дөңгелек үстелде айтқан пікірлерін барлық 11 пәннің Сарапшылары
            бірге отырып бағалайды.
          </p>
          <p style={{ color: 'blue' }}>
            ІІІ кезеңнің қорытындысы бойынша байқаудың жалпы қорытындысы шығады:
            Гран - при (1); I орын (1); II орын (1); III орын (2). Барлығы – 5
            жеңімпаз анықталады.
          </p>
          <div>
            Байқау шарттарымен таныссаң қатысуға асық! Ұстаздың құтты білігінен
            шәкірттің құнды біліміне жеткізер жолды көрсет!
          </div>
        </div>
        <div style={{ marginTop: 50 }}>
          <ButtonComponent
            word="Қатысуға өтінім беру"
            onClick={() => {
              window.location.href =
                'https://docs.google.com/forms/d/e/1FAIpQLSd9XjX6jxZ6JvZ8a7Z6G5U6w5j6r5pYh1r6X1XjK7x6H5D2jQ/viewform?usp=sf_link'
            }}
          />
        </div>
      </div>
      <div>
        <h1
          style={{ display: 'flex', justifyContent: 'center', marginTop: 100 }}
          ref={refSpeaker}
        >
          Спикерлер
        </h1>
        <div className="speaker">
          <div className="richard">
            <img
              className="img"
              src="https://almatyustazy.kz/upload/iblock/78c/52fr3o0jk8rn1v10901smi8r7wy4hrl7/kulatta_rem_s.png"
              alt=""
            />
            <div>
              <h3 style={{ color: 'white' }}>Ричард Кулатта</h3>
              <p style={{ color: 'white' }}>
                Білім берудегі цифрлық технологиялармен айналысатын АҚШ-тың ең
                ірі компаниясының ISTE директоры
              </p>
              <h3 style={{ color: 'white' }}>
                «Қашықтан оқытудың цифрлық қызметтері мен құралдары»
              </h3>
            </div>
          </div>
          <div className="richardRight">
            <img
              src="https://almatyustazy.kz/upload/iblock/01d/urabak2cld7p439mr9efu4ci1vpo863s/image-83.png"
              alt="1"
            />
            <img
              src="https://almatyustazy.kz/upload/resize_cache/iblock/f63/6lwr2z5ymlshlw9fzh861398a15j1t60/275_275_1/imgonline_com_ua_Resize_vuoir9vVT57.jpg"
              alt="2"
            />
            <img
              src="https://almatyustazy.kz/upload/resize_cache/iblock/87b/979ow4fwknj0vj3h6z1lgxap06fs92pl/275_275_1/ludmila_rojdestvenskaya_cr.png"
              alt="3"
            />
            <img
              src="https://almatyustazy.kz/upload/resize_cache/iblock/0ad/84lmsi294v8zcvk1vqis51sl2i8t8kvo/275_275_1/WhatsApp_Image_2022_08_01_at_23.45.42_removebg_preview.png"
              alt="4"
            />
            <img
              src="https://almatyustazy.kz/upload/resize_cache/iblock/92f/fy2xtxqs8cnk06s6xihs5s5ttw2qp09i/275_275_1/IMG_2612.jpg"
              alt="5"
            />
          </div>
        </div>
      </div>
    </>
  )
}

export default Stages
